app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `user`
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `user_status` = 'waiting'
SELECT COUNT(*) AS `numrows`
FROM `dis_award`
SELECT *
FROM `dis_config`
WHERE `co_status` = 'Active'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `admin_online`
WHERE `checktype` = 'dis'
---
    public function index() {

        $userModel = new UsersModel;
        $awardModel = new AwardsModel;
        $areaModel = new AreasModel;
        $schoolModel = new SchoolsModel;
        $clusterModel = new ClustersModel;
        $disConfigModel = new DisConfigsModel;
        $adminOnlineModel = new AdminsOnlinesModel;

        $data = [
            'title' => [
                '1' => 'Dashboard, Admin',
            ],
            'teacher' => $userModel->countAllResults(),
            'confirm' => $userModel->where('user_status', 'waiting')->countAllResults(),
            'award' => $awardModel->countAllResults(),
            'awardall' => $awardModel->countAllResults(),
            'config' => $disConfigModel->where('co_status', 'Active')->first(),
            'DateNow' => date("Y-m-d"),
            'useronline' => $adminOnlineModel->where('checktype','dis')->countAllResults(),

SELECT *
FROM `dis_year`
SELECT COUNT(*) AS `numrows`
FROM `admin_online`
WHERE `checktype` = 'dis'
---
public function list_year(){

    $disYearModel = new DisYearsModel;
    $adminOnlineModel = new AdminsOnlinesModel;

    $data = [
        'title' => [
        '1' => 'ปีการศึกษา'
        ],
        'year' => $disYearModel->findall(),
        'useronline' => $adminOnlineModel->where('checktype','dis')->countAllResults(),

SELECT *
FROM `dis_config`
SELECT COUNT(*) AS `numrows`
FROM `admin_online`
WHERE `checktype` = 'dis'
---
public function list_config(){

    $disConfigModel = new DisConfigsModel;
    $adminOnlineModel = new AdminsOnlinesModel;

    $data = [
        'title' => [
        '1' => 'กำหนดการประเมิน'
        ],
        'config' => $disConfigModel->findall(),
        'useronline' => $adminOnlineModel->where('checktype','dis')->countAllResults(),

SELECT COUNT(*) AS `numrows`
FROM `admin_online`
WHERE `checktype` = 'dis'
---
public function admin_user()
{
    helper(['form']);
    $adminsUsersModel = new AdminsUsersModel;
    $adminOnlineModel = new AdminsOnlinesModel;

    $data = [
        'title' => [
        '1' => 'รายการผู้ดูแลระบบ'
        ],
        'user' => $adminsUsersModel->findall(),
        'useronline' => $adminOnlineModel->where('checktype','dis')->countAllResults(),

SELECT *
FROM `cluster`
SELECT *
FROM `area`
SELECT *
FROM `area_user`
SELECT COUNT(*) AS `numrows`
FROM `admin_online`
WHERE `checktype` = 'dis'
---
public function area_user()
{
    helper(['form']);
    $areasUsersModel = new AreasUsersModel;
    $areasModel = new AreasModel;
    $clustersModel = new ClustersModel;
    $areasUsersModel = new AreasUsersModel;
    $adminOnlineModel = new AdminsOnlinesModel;

    $data = [
        'title' => [
        '1' => 'รายการผู้ใช้งานเขตฯ'
        ],
        'cluster' => $clustersModel->findall(),
        'area' => $areasModel->findall(),
        'user' => $areasUsersModel->findall(),
        'useronline' => $adminOnlineModel->where('checktype','dis')->countAllResults(),

SELECT *
FROM `cluster`
SELECT COUNT(*) AS `numrows`
FROM `admin_online`
WHERE `checktype` = 'dis'
---
public function cluster_user()
{
    helper(['form']);
    $clustersUsersModel = new ClustersUsersModel;
    $clustersModel = new ClustersModel;
    $clustersUsersModel = new ClustersUsersModel;
    $adminOnlineModel = new AdminsOnlinesModel;

    $data = [
        'title' => [
        '1' => 'รายการผู้ใช้งานเขตตรวจราชการ'
        ],
        'cluster' => $clustersModel->findall(),
        'user' => $clustersUsersModel->findall(),
        'useronline' => $adminOnlineModel->where('checktype','dis')->countAllResults(),

SELECT *
FROM `user`
SELECT COUNT(*) AS `numrows`
FROM `admin_online`
WHERE `checktype` = 'dis'
---
public function get_user()
{
    helper(['form']);
    $schoolsModel = new SchoolsModel;
    $areasModel = new AreasModel;
    $clustersModel = new ClustersModel;
    $usersModel = new UsersModel;
    $adminOnlineModel = new AdminsOnlinesModel;

    $data = [
        'title' => [
        '1' => 'รายการผู้ใช้งานโรงเรียน'
        ],
//        'cluster' => $clustersModel->findall(),
//        'area' => $areasModel->findall(),
//        'school' => $schoolsModel->findall(),
        'user' => $usersModel->findall(),
        'useronline' => $adminOnlineModel->where('checktype','dis')->countAllResults(),