app/Controllers/AreaController.php

SELECT COUNT(*) AS `numrows`
FROM `area_online`
WHERE `checktype` = 'dis'
---
    public function index() {
        $userModel = new UsersModel;
        $awardModel = new AwardsModel;
        $areaModel = new AreasModel;
        $schoolModel = new SchoolsModel;
        $clusterModel = new ClustersModel;
        $disConfigModel = new DisConfigsModel;
        $areaOnlineModel = new AreasOnlinesModel;
        $data = [
            'title' => [
                '1' => 'Dashboard,เขตพื้นที่ฯ'
            ],
            'useronline' => $areaOnlineModel->where('checktype','dis')->countAllResults(),