app/Controllers/ClusterController.php

    public function index() {
        $userModel = new UsersModel;
        $awardModel = new AwardsModel;
        $areaModel = new AreasModel;
        $schoolModel = new SchoolsModel;
        $clusterModel = new ClustersModel;
        $kuruConfigModel = new KurusConfigsModel;
        $clusterOnlineModel = new ClustersOnlinesModel;

        $data = [
            'title' => [
                '1' => 'Dashboard, เขตตรวจราชการ',
            ],
            'useronline' => $clusterOnlineModel->where('checktype','kuru')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `cluster_online`
WHERE `checktype` = 'dis'