app/Controllers/Login.php

    public function auth() {
        //$request = \Config\Services::request();
        helper(['form']);
        $session = session();
        $userModel = new UsersModel;
        $schoolModel = new SchoolsModel;
        $areaModel = new AreasModel;
        $clusterModel = new ClustersModel;
        $prefixModel = new prefixModel;
        $areaModel = new AreasModel;
        $adminuserModel = new AdminsUsersModel;
        $areauserModel = new AreasUsersModel;
        $clusteruserModel = new ClustersUsersModel;

        $adminloginModel = new AdminsLoginsModel;
        $arealoginModel = new AreasLoginsModel;
        $clusterloginModel = new ClustersLoginsModel;
        //$userloginModel = new UsersLoginsModel;

        $user_idcard = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $CheckType = $this->request->getVar('checktype');

        if($CheckType==1): // school

        $data = $userModel->where(['user_idcard' => $user_idcard, 'user_status' => 'Active'])->first();
        if($data) {
            $pass = $data['user_hashpassword'];
            $verify_password = password_verify($password, $pass);
            if($verify_password) {
                $schoolname = $schoolModel->where('sch_id', $data['sch_id'])->first();
---
SELECT *
FROM `user`
WHERE `user_idcard` = '3460600401333'
AND `user_status` = 'Active'
 LIMIT 1
SELECT *
FROM `school`
WHERE `sch_id` = '1224'
 LIMIT 1


        elseif($CheckType==2): // area

        $data = $areauserModel->where(['user_idcard' => $user_idcard, 'user_status' => 'Active'])->first();
---
SELECT *
FROM `area_user`
WHERE `user_idcard` = 'Atomy'
AND `user_status` = 'Active'
 LIMIT 1

            $verify_password = password_verify($password, $pass);
            if($verify_password) {
                //$schoolname = $schoolModel->where('sch_id', $data['sch_id'])->first();
                $areaname = $areaModel->where('area_code', $data['user_area'])->first();
---
SELECT *
FROM `area`
WHERE `area_code` = '1000440001'
 LIMIT 1

                    'datetime' => date("Y-m-d H:i:s")
                );

                $arealoginModel->insert($arrayAreaLogin);
---
INSERT INTO `area_login` (`checktype`, `ip_address`, `username`, `clus`, `area`, `last_activity`, `datetime`) VALUES ('dis', '::1', 'Atomy', '13', '1000440001', 1673444326, '2023-01-11 20:38:46')


        elseif($CheckType==3): // cluster

        $data = $clusteruserModel->where(['user_idcard' => $user_idcard, 'user_status' => 'Active'])->first();
---
SELECT *
FROM `cluster_user`
WHERE `user_idcard` = 'Atomy'
AND `user_status` = 'Active'
 LIMIT 1

            $verify_password = password_verify($password, $pass);
            if($verify_password) {
                //$schoolname = $schoolModel->where('sch_id', $data['sch_id'])->first();
                $clustername = $clusterModel->where('clus_id', $data['user_clus'])->first();
---
SELECT *
FROM `cluster`
WHERE `clus_id` = '13'
 LIMIT 1

                    'datetime' => date("Y-m-d H:i:s")
                );

                $clusterloginModel->insert($arrayClusLogin);
---
INSERT INTO `cluster_login` (`checktype`, `ip_address`, `username`, `clus`, `last_activity`, `datetime`) VALUES ('dis', '::1', 'Atomy', '13', 1673444306, '2023-01-11 20:38:26')


        elseif($CheckType==4): // admin

        $data = $adminuserModel->where(['user_idcard' => $user_idcard, 'user_status' => 'Active'])->first();
---
SELECT *
FROM `admin_user`
WHERE `user_idcard` = 'Atomy'
AND `user_status` = 'Active'
AND `admin_user`.`deleted_at` IS NULL
 LIMIT 1

                    'datetime' => date("Y-m-d H:i:s")
                );

                $adminloginModel->insert($arrayAdminLogin);
---
INSERT INTO `admin_login` (`checktype`, `ip_address`, `username`, `last_activity`, `datetime`) VALUES ('dis', '::1', 'Atomy', 1673442581, '2023-01-11 20:09:41')