app/Controllers/RegisterController.php

SELECT *
FROM `prefix`
ORDER BY `prefix_id` ASC
SELECT *
FROM `area`
ORDER BY `area_id` ASC
SELECT *
FROM `cluster`
ORDER BY `clus_id` ASC
---
    public function RegArea() {

        helper(['form']);
        $session = session();
        $userModel = new UsersModel;
        $schoolModel = new SchoolsModel;
        $areaModel = new AreasModel;
        $clusterModel = new ClustersModel;
        $prefixModel = new prefixModel;
        $areaModel = new AreasModel;
        $adminuserModel = new AdminsUsersModel;
        $areauserModel = new AreasUsersModel;
        $clusteruserModel = new ClustersUsersModel;

        if($session->get('checktype') != "area" or isset($session)){

            $data = [
                'title' => [
                    '1' => 'ลงทะเบียนสำหรับเขตพื้นที่',
                ],
                'prefix' => $prefixModel->orderBy('prefix_id', 'asc')->findall(),
                'area' => $areaModel->orderBy('area_id', 'asc')->findall(),
                'cluster' => $clusterModel->orderBy('clus_id', 'asc')->findall(),

SELECT *
FROM `prefix`
ORDER BY `prefix_id` ASC
SELECT *
FROM `cluster`
ORDER BY `clus_id` ASC
---
    public function RegCluster() {

        helper(['form']);
        $session = session();
        $userModel = new UsersModel;
        $schoolModel = new SchoolsModel;
        $areaModel = new AreasModel;
        $clusterModel = new ClustersModel;
        $prefixModel = new prefixModel;
        $areaModel = new AreasModel;
        $adminuserModel = new AdminsUsersModel;
        $areauserModel = new AreasUsersModel;
        $clusteruserModel = new ClustersUsersModel;

        if($session->get('checktype') != "cluster" or isset($session)){

            $data = [
                'title' => [
                    '1' => 'ลงทะเบียนสำหรับเขตตรวจราชการ',
                ],
                'prefix' => $prefixModel->orderBy('prefix_id', 'asc')->findall(),
                'cluster' => $clusterModel->orderBy('clus_id', 'asc')->findall(),

SELECT *
FROM `school`
WHERE `sch_area` = 1000100700
---
    public function schoolSearch()
    {
        $schoolModel = new SchoolsModel;
        $code = json_decode($_POST["code"]);
        $data = $schoolModel->where('sch_area', $code)->findall();