app/Controllers/SchoolController.php

public function index() {

    //helper(['functions']);

    $userModel = new UsersModel;
    $awardModel = new AwardsModel;
    $areaModel = new AreasModel;
    $clusterModel = new ClustersModel;
    $disConfigModel = new DisConfigsModel;
    $userOnlineModel = new UsersOnlinesModel;

    $data = [
        'title' => [
            //'1' => 'Dashboard ผู้ใช้งานโรงเรียน,'.session()->get('fullname')
            '1' => 'Dashboard ผู้ใช้งานโรงเรียน',
        ],
        'teacher' => $userModel->where('sch_id',session()->get('school'))->where('user_role', 'teacher')->countAllResults(),
        'confirm' => $userModel->where('sch_id',session()->get('school'))->where('user_status', 'waiting')->countAllResults(),
        'award' => $awardModel->where('sch_id',session()->get('school'))->countAllResults(),
        'awardall' => $awardModel->countAllResults(),
        'config' => $disConfigModel->where('co_status', 'Active')->first(),
---
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `sch_id` = '1224'
AND `user_role` = 'teacher'
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `sch_id` = '1224'
AND `user_status` = 'waiting'
SELECT COUNT(*) AS `numrows`
FROM `dis_award`
WHERE `sch_id` = '1224'
SELECT COUNT(*) AS `numrows`
FROM `dis_award`
SELECT *
FROM `dis_config`
WHERE `co_status` = 'Active'
 LIMIT 1