app/Models/UsersModel.php

SELECT `user`.*, `area`.*, `school`.*, (user.user_id) as user_id, CONCAT(user.user_prefix, `user_fname`, " ", user.user_lname) As username
FROM `user`
LEFT JOIN `area` ON `area`.`area_code`=`user`.`user_area`
LEFT JOIN `school` ON `school`.`sch_id`=`user`.`sch_id`
---
public function getUserAll() {

  return  $this->select('user.*,area.*,school.*,(user.user_id) as user_id,
          CONCAT(user.user_prefix,user_fname," ",user.user_lname) As username')
          ->join('area', 'area.area_code=user.user_area', 'LEFT')
          ->join('school', 'school.sch_id=user.sch_id', 'LEFT')
          //->where(['user_up.iu_area' => session()->get('area_code'),'user_up.iu_school' => session()->get('sch_code')])
          //->orderBy('C_id', 'DESC')
          //->groupby('user.id')
          ->findAll();

SELECT `user`.*, `area`.*, `school`.*, (user.user_id) as user_id, CONCAT(user.user_prefix, `user_fname`, " ", user.user_lname) As username
FROM `user`
LEFT JOIN `area` ON `area`.`area_code`=`user`.`user_area`
LEFT JOIN `school` ON `school`.`sch_id`=`user`.`sch_id`
---
public function getUserAllLimit($limit = false, $length = false) {

  return  $this->select('user.*,area.*,school.*,(user.user_id) as user_id,
          CONCAT(user.user_prefix,user_fname," ",user.user_lname) As username')
          ->join('area', 'area.area_code=user.user_area', 'LEFT')
          ->join('school', 'school.sch_id=user.sch_id', 'LEFT')
          //->where(['user.it_main' => $main,'user.it_sub' => $sub])
          ->limit($limit,$length)
          //->orderBy('user.user_id', 'DESC')
          //->groupby('user.user_id')
          ->findAll();